# Напишите программу для вычисления суммы двух чисел. Оба числа вводятся пользователем. Для вычисления суммы используйте оператор +.


class Main:

    print(int(input("Введите первое число: ")) + int(input("Введите второе число: ")))